---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LinesOverlap
source: html/b324a7df-36b7-6700-4fd4-67dbbcc93c6e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.LinesOverlap Property

Cannot have overlapping lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId LinesOverlap { get; }
```